<template>
    <div>
        <span>设备-工艺总览表</span>
        <div id="main" style="width: 1200px;height:600px;"></div>
    </div>
</template>

<script>
var echarts = require('echarts')

export default {
    data() {
        return {
            myChart: '',
            data: [
                [0,0,5],[0,1,1],[0,2,0],[0,3,1],[0,4,1],[0,5,0],[0,6,0],[0,7,0],[0,8,0],[0,9,0],[0,10,0],[0,11,2],[0,12,4],[0,13,1],[0,14,1],[0,15,3],[0,16,4],
                [1,0,7],[1,1,0],[1,2,2],[1,3,0],[1,4,3],[1,5,4],[1,6,0],[1,7,0],[1,8,0],[1,9,5],[1,10,5],[1,11,2],[1,12,2],[1,13,6],[1,14,1],[1,15,0],[1,16,6],
                [2,0,1],[2,1,1],[2,2,0],[2,3,4],[2,4,0],[2,5,0],[2,6,0],[2,7,2],[2,8,0],[2,9,0],[2,10,3],[2,11,2],[2,12,1],[2,13,9],[2,14,5],[2,15,4],[2,16,6],
                [3,0,7],[3,1,3],[3,2,6],[3,3,0],[3,4,2],[3,5,0],[3,6,0],[3,7,0],[3,8,1],[3,9,0],[3,10,5],[3,11,4],[3,12,7],[3,13,4],[3,14,6],[3,15,4],[3,16,9],
                [4,0,1],[4,1,3],[4,2,0],[4,3,0],[4,4,0],[4,5,1],[4,6,0],[4,7,1],[4,8,0],[4,9,2],[4,10,4],[4,11,4],[4,12,2],[4,13,4],[4,14,4],[4,15,4],[4,16,2],
                [5,0,2],[5,1,1],[5,2,2],[5,3,3],[5,4,0],[5,5,0],[5,6,0],[5,7,0],[5,8,2],[5,9,0],[5,10,4],[5,11,1],[5,12,5],[5,13,10],[5,14,5],[5,15,7],[5,16,1],
                [6,0,3],[6,1,2],[6,3,3],[6,3,3],[6,4,1],[6,6,1],[6,6,1],[6,7,0],[6,8,3],[6,9,0],[6,10,4],[6,11,2],[6,12,6],[6,13,10],[6,14,6],[6,15,7],[6,16,2],
                [7,0,3],[7,1,4],[7,3,1],[7,3,3],[7,4,2],[7,7,0],[7,6,0],[7,7,5],[7,8,3],[7,9,0],[7,10,4],[7,11,4],[7,12,7],[7,13,10],[7,14,7],[7,15,7],[7,16,4]
            ],
            option: {
                tooltip: {
                    position: 'top'
                },
                animation: false,
                grid: {
                    height: '50%',
                    y: '10%'
                },
                xAxis: {
                    type: 'category',
                    data: '',
                    splitArea: {
                        show: true
                    }
                },
                yAxis: {
                    type: 'category',
                    data: '',
                    splitArea: {
                        show: true
                    }
                },
                visualMap: { // 下方图例
                    min: 0,
                    max: 2,
                    calculable: true,
                    orient: 'horizontal',
                    left: 'center',
                    bottom: '30%'
                },
                series: [{
                    name: '设备信息',
                    type: 'heatmap',
                    data: '',
                    label: {
                        normal: {
                            show: true
                        }
                    },
                    itemStyle: {
                        emphasis: {
                            shadowBlur: 10,
                            shadowColor: 'rgba(0, 0, 0, 0.5)'
                        }
                    }
                }]
                },
                process: [
                    '原矿', '筛分', '粉矿', '块矿', '强磁磨矿', '强磁选别', '精矿浓缩',
                    '精矿过滤', '竖炉焙烧', '废石','弱磁磨矿','弱磁选别',
                    '中矿浓缩', '反浮选', '尾矿浓缩', '精矿库', '尾矿库'
                    ],
                devices: [
                    '竖炉', '球磨机', '弱磁选机','过滤机',
                    '强磁选机', '高梯度', '高频细筛', '柱塞泵'
                    ],
        }
    }, // data
    computed: {
    },
    methods: {
        // 初始化数据
        setData() {
            this.data = this.data.map(function (item) { // 交换x-y轴
                return [item[1], item[0], item[2] || '-']
            })
            this.option.series[0].data = this.data
            this.option.xAxis.data = this.process
            this.option.yAxis.data = this.devices
            this.myChart.setOption(this.option)
        }
    },
    mounted() {
        this.myChart = echarts.init(document.getElementById('main'))
        this.setData()
    }
}
</script>
<style>

</style>
